{"version": "1.6","name": "Zolid Framework v0.1.0","subline": "Open source website and user framework.","username": "Mark Eliasen (@markeliasen)","created": "03/10/2011","website": "http://zolidweb.com","update": "02/14/2013","update_today": true,"email": "mse@zolid.eu","intro": "Thank you for downloading the Zolid Framework!","sections": [{"title": "License","id": "license","content": "<p>\tCopyright (c) 2013, Mark Eliasen<br>\n\tAll rights reserved.</p>\n<div>\n\t&nbsp;</div>\n<div>\n\tRedistribution and use in source and binary forms, with or without modification, are permitted provided that the following conditions are met:</div>\n<div>\n\t&nbsp;- Redistributions of source code must retain the above copyright notice, this list of conditions and the following disclaimer.</div>\n<div>\n\t&nbsp;- Redistributions in binary form must reproduce the above copyright notice, this list of conditions and the following disclaimer&nbsp;</div>\n<div>\n\t&nbsp; &nbsp;in the documentation and/or other materials provided with the distribution.</div>\n<div>\n\t&nbsp;- Neither the name of the Zolid Web Solutions nor the names of its contributors may be used to endorse or promote products derived&nbsp;</div>\n<div>\n\t&nbsp; &nbsp;from this software without specific prior written permission.</div>\n<div>\n\t&nbsp;</div>\n<div>\n\tTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS &quot;AS IS&quot; AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.</div>\n"},{"title": "Installing","id": "installing","content": "<p>\tInstalling the Zolid Framework is very easy. You simply upload your files to your web host, and navigate your browser to where you uploaded the files, and the installer should open automatically, else navigate to it by appending &quot;/install&quot; (without the quotes) to the url. Example: www.domain.com/install</p>\n<p>\t<strong>Deleting the install.php file from the &quot;/ core / templates /&quot; directory is recommended once the install is complete.</strong></p>\n"},{"title": "Adding Pages","id": "adding_pages","content": "<p>\t<strong>Adding pages</strong></p>\n<p>\tDefault pages are build up the folling way:</p>\n<p>\t<img alt=\"\" src=\"http://zolidframe.zolidcore.com/documentation/doc_1.jpg\" style=\"width: 517px; height: 338px;\"></p>\n<p>\tA) This part blocks users from viewing the file directly, eg. if the navigate to the file directly.<br>\n\t<br>\n\tB) This part means that if the user is not logged in, redirect them to the frontpage/base url of the site. Of cause this is only required if you want the page to be for members only.<br>\n\t<br>\n\tC) This is where your HTML, additional PHP or like goes. This is your page&#39;s content.</p>\n<p>\tRemember when you add new pages to update your navigation as well in the &quot;generateNavigation()&quot; function in the file:&nbsp;&quot;/ core / classes / template.class.php &quot;</p>\n"},{"title": "General Useage","id": "general_useage","content": "<p>\tMost of the classes are loaded together, and can be accessed with $this in eg. your template files. You can open any of the classes, and read through the documentation block at the top of each function to learn more about what each function do.</p>\n<p>\tThere are a couple of static classes as well, which can be accessed anywhere:</p>\n<ul>\t<li>\t\tNotifications</li>\n\t<li>\t\tSecurity</li>\n\t<li>\t\tCache</li>\n</ul>\n<p>\tTo give you an example of how to use a static class anywhere you wish, I&#39;ll show you how to use the notifications class:</p>\n<div>\n\tYou can set and show notifications using this class. The way to use this class is as follows:</div>\n<div>\n\t<em>Notifications::function_name( $variables );</em></div>\n<p>\t<strong>Set new notifications to be displayed:</strong><br>\n\t<span style=\"font-size: 12px;\">Set the notification to display to the user at the given position on your site.</span></p>\n<div>\n\t$where (string)&nbsp;- the identifier for where to display the notification (see the showNotification function)</div>\n<div>\n\t$body&nbsp;(string) - the notification text</div>\n<div>\n\t$title&nbsp;(string) - the notification title (can be left blank)</div>\n<div>\n\t$type&nbsp;(string) - can be one of the following: error, warning, success, info</div>\n<p>\tExample: Notifications::setNotification( $where, $body, $title, $type );</p>\n<p>\t<br>\n\t<strong>Show notifications:</strong><br>\n\tShow notifications which are set for the specific area you specify. If no notification is available, it will return nothing.</p>\n<p>\t&nbsp;</p>\n<div>\n\t$where (string)&nbsp;-&nbsp;the identifier used to look for notification. Eg. if you set a notification with $where = login_1, you need to use this for fetching the notification here</div>\n<p>\tExample: Notifications::showNotification( $where );</p>\n"},{"title": "Design","id": "design","content": "<p>\tThis system was build using the Twitter Bootstrap for the design. You can read more about Twitter Bootstrap on their official GitHub page and read the documentation on how to use it.</p>\n<p>\t&nbsp;</p>\n"}],"use_sub": false,"logo": "http://zolidweb.com/images/logo-globe.png","favicon": "","customcss": "","easing": "swing","easingduration": "500","bgimage": "","bgrepeat": "repeat","bgattachment": "scroll","bgcolor": "FFFFFF","textcolor": "383838","linkcolor": "0000FF","hrcolor1": "EBEBEB","hrcolor2": "FFFFFF","sidebarbgimage": "","sidebarbgrepeat": "repeat","sidebarbgcolor": "DDDDDD","sidebartextcolor": "222222","sidebarlinkcolor": "444444","sidebaractivecolor": "444444","sidebaractivetextcolor": "DDDDDD","sidebarhrcolor1": "AAAAAA","sidebarhrcolor2": "EEEEEE","cufon": "","itemURL": "","sendJSON": "","sendZIP": "","sendPWD": ""}